nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
/**************************************************************************//**
 * @file     Nano1X2Series.h
 * @version  V1.00
 * $Revision: 89 $
 * $Date: 14/12/26 9:22a $
 * @brief    Nano102/112  peripheral access layer header file.
 *           This file contains all the peripheral register's definitions,
 *           bits definitions and memory mapping for NuMicro Nano102/112 MCU.
 *
 * @note
 * Copyright (C) 2013-2014 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
/**
   \mainpage NuMicro Nano102/112 Driver Reference Guide
   *
   * <b>Introduction</b>
   *
   * This user manual describes the usage of Nano102/112 Series MCU device driver
   *
   * <b>Disclaimer</b>
   *
   * The Software is furnished "AS IS", without warranty as to performance or results, and
   * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
   * warranties, express, implied or otherwise, with regard to the Software, its use, or
   * operation, including without limitation any and all warranties of merchantability, fitness
   * for a particular purpose, and non-infringement of intellectual property rights.
   *
   * <b>Important Notice</b>
   *
   * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
   * any malfunction or failure of which may cause loss of human life, bodily injury or severe
   * property damage. Such applications are deemed, "Insecure Usage".
   *
   * Insecure usage includes, but is not limited to: equipment for surgical implementation,
   * atomic energy control instruments, airplane or spaceship instruments, the control or
   * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
   * instruments, all types of safety devices, and other applications intended to support or
   * sustain life.
   *
   * All Insecure Usage shall be made at customer's risk, and in the event that third parties
   * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
   * the damages and liabilities thus incurred by Nuvoton.
   *
   * Please note that all data and specifications are subject to change without notice. All the
   * trademarks of products and companies mentioned in this datasheet belong to their respective
   * owners.
   *
   * <b>Copyright Notice</b>
   *
   * Copyright (C) 2013-2014 Nuvoton Technology Corp. All rights reserved.
   */
/**
  * \page pg1 NuMicro Nano102/112 BSP Directory Structure
  * Please refer to Readme.pdf under BSP root directory for the BSP directory structure
  *
  * \page pg2 Revision History
  *
  * <b>Revision 3.01.000</b>
  * \li Fixed GPIO_DISABLE_DIGITAL_PATH(), GPIO_ENABLE_DIGITAL_PATH(),GPIO_DISABLE_DOUT_MASK(),GPIO_ENABLE_DOUT_MASK(), GPIO_DISABLE_PULL_UP(), and GPIO_ENABLE_PULL_UP() implementation error.
  * \li Fixed SYS_PC_L_MFP_PC0_MFP_LCD_S11, SYS_PC_L_MFP_PC0_MFP_LCD_S18, SYS_PC_L_MFP_PC0_MFP_LCD_S22, SYS_PC_H_MFP_PC10_MFP_I2C1_SCL, SYS_PC_H_MFP_PC11_MFP_I2C1_SDA,
  *           SYS_PD_H_MFP_PD13_MFP_EINT1, SYS_PD_H_MFP_PD10_MFP_LCD_COM0, SYS_PD_H_MFP_PD10_MFP_LCD_COM0, SYS_PD_H_MFP_PD9_MFP_LCD_COM1, SYS_PD_H_MFP_PD8_MFP_LCD_COM2,
  *           SYS_PF_L_MFP_PF5_MFP_ICE_DAT, and SYS_PF_L_MFP_PF4_MFP_ICE_CLK definition error.
  * \li Fixed SYS_DISABLE_BOD*(), and SYS_ENABLE_BOD*() implementation error.
  * \li Fixed PDMA_WIDTH_* definition error
  * \li Fixed PWM_ConfigOutputChannel() and PWM_ConfigCaptureChannel() PWM channel 2 and 3 clock setting error.
  * \li Fixed SPI_SET_SSx_LOW(), SPI_SET_SSx_HIGH(), SPI_CLR_3WIRE_START_INT_FLAG(), and SPI_CLR_UNIT_TRANS_INT_FLAG()implementation error.
  * \li Fixed SPI_Open(), SPI_SetBusClock() and SPI_GetBusClock() clock frequency calculation.
  * \li Fixed I2C_Open(), I2C_GetBusClockFreq(), and I2C_SetBusClockFreq() clock frequency calculation error.
  * \li Replaced the *_MFP_TIMERx_EXT setting with *_MFP_TIMERx_CNT and *_TIMERx_OUT.
  * \li Renamed *_MFP_CKOHZ to *_MFP_CLK_Hz.
  * \li Renamed SYS_PA_L_MFP_PA5_MFP_SC2_RST to SYS_PA_L_MFP_PA5_MFP_SC0_PWR.
  * \li Renamed SYS_PA_H_MFP_PA10_MFP_SC0_DAT to SYS_PA_H_MFP_PA10_MFP_SC0_CLK.
  * \li Renamed SYS_PA_H_MFP_PA12_MFP_I2C1_SCL to SYS_PA_H_MFP_PA12_MFP_I2C0_SCL.
  * \li Renamed SYS_PA_H_MFP_PA13_MFP_I2C0_DAT to SYS_PA_H_MFP_PA13_MFP_I2C0_SDA.
  * \li Renamed SYS_PA_H_MFP_PA15_MFP_I2C_DAT to SYS_PA_H_MFP_PA15_MFP_I2C1_SDA.
  * \li Renamed SYS_PB_L_MFP_PB3_MFP_I2C_DAT to SYS_PB_L_MFP_PB3_MFP_I2C0_SDA.
  * \li Renamed SYS_PB_L_MFP_PB5_MFP_SPI2_MOSI1 to SYS_PB_L_MFP_PB5_MFP_SPI1_MOSI1
  * \li Renamed SYS_PB_L_MFP_PB7_MFP_CD to SYS_PB_L_MFP_PB7_MFP_SC0_CD.
  * \li Renamed SYS_PB_H_MFP_PB10_MFP_SPI1_MOSI1 to SYS_PB_H_MFP_PB10_MFP_SPI0_MOSI1.
  * \li Renamed SYS_PD_L_MFP_PD7_MFP_LCD_S3 to SYS_PD_L_MFP_PD7_MFP_LCD_COM3.
  * \li Renamed SYS_PD_H_MFP_PD11_MFP_LCD_DH1 to SYS_PD_H_MFP_PD11_MFP_LCD_DH2.
  * \li Renamed SYS_PD_H_MFP_PD12_MFP_LCD_DH2 to SYS_PD_H_MFP_PD12_MFP_LCD_DH1.
  * \li Renamed SYS_PF_L_MFP_PF2_MFP_HXT_OUT to SYS_PF_L_MFP_PF2_MFP_XT1_IN.
  * \li Renamed SYS_PF_L_MFP_PF3_MFP_HXT_IN to SYS_PF_L_MFP_PF3_MFP_XT1_OUT.
  * \li Renamed SYS_PF_L_MFP_PF1_MFP_ICE_CLK to SYS_PF_L_MFP_PF4_MFP_ICE_CLK.
  * \li Renamed SYS_PF_L_MFP_PF0_MFP_ICE_DAT to SYS_PF_L_MFP_PF5_MFP_ICE_DAT.
  * \li Updated CLK_EnableCKO() to set clock source before output enable.
  * \li Updated I2C_WAIT_READY() to clear I2C_INTSTS_INTSTS_Msk before exiting macro.
  * \li Updated FMC_Erase() to avoid modifying FMC->ISPCON register setting.
  * \li Added SYS_PD_H_MFP_PD11_MFP_PWM0_CH1 definition.
  * \li Added ADC_PDMA, ADC_TimerTrigger, GPIO_PowerDown, Hard_Fault_Sample, PWM_CapturePDMA, SPI_TxRxLoopback_PDMA, SYS_PLLClockOutput, UART_FlowCtrl, and UART_Rx_Wakeup samples.
  *
  * <b>Revision 3.00.001</b>
  * \li Improved PWM capture function performance.
  * \li Added ADC_SET_REF_VOLTAGE macro to configure ADC reference voltage.
  * \li Minor bug fix.
  *
  * <b>Revision 3.00.000</b>
  * \li Changed major version number from 1 to 3.
  * \li Renamed I2C_SetClockBusFreq() to I2C_SetBusClockFreq().
  * \li Renamed I2C_SetSlaveMask() to I2C_SetSlaveAddrMask().
  * \li Renamed RTC_GetDatAndTime() to RTC_GetDateAndTime().
  * \li Added Learning Board sample.
  * \li Moved Smartcard libraries one directory level up to "Library\SmartcardLib\".
  * \li Minor bug fix.
  *
  * <b>Revision 1.00.000</b>
  * \li Initial release.
*/
#ifndef __NANO1X2SERIES_H__
#define __NANO1X2SERIES_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup NANO1X2_Definitions NANO102/112 Definitions
  This file defines all structures and symbols for NANO102/112:
    - interrupt numbers
    - registers and bit fields
    - peripheral base address
    - peripheral ID
    - Peripheral definitions
  @{
*/

/******************************************************************************/
/*                Processor and Core Peripherals                              */
/******************************************************************************/
/** @addtogroup NANO1X2_CMSIS Device CMSIS Definitions
  Configuration of the Cortex-M0 Processor and Core Peripherals
  @{
*/

/**
 * @details  Interrupt Number Definition. The maximum of 32 Specific Interrupts are possible.
 */
typedef enum IRQn {
    /******  Cortex-M0 Processor Exceptions Numbers *****************************************/

