nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
#define ACMP_CR_ACMP_HYSEN_Pos         (2)                                                 /*!< ACMP CR: ACMP_HYSEN Position         */
#define ACMP_CR_ACMP_HYSEN_Msk         (0x1ul << ACMP_CR_ACMP_HYSEN_Pos)                   /*!< ACMP CR: ACMP_HYSEN Mask             */

#define ACMP_CR_CN_Pos                 (4)                                                 /*!< ACMP CR: CN Position                 */
#define ACMP_CR_CN_Msk                 (0x3ul << ACMP_CR_CN_Pos)                           /*!< ACMP CR: CN Mask                     */

#define ACMP_CR_ACMP0_EX_Pos            (16)                                               /*!< ACMP CR: ACMP0_EX Position            */
#define ACMP_CR_ACMP0_EX_Msk            (0x1ul << ACMP_CR_ACMP0_EX_Pos)                    /*!< ACMP CR: ACMP0_EX Mask                */

#define ACMP_CR_ACMP0_INV_Pos           (17)                                               /*!< ACMP CR: ACMP0_INV  Position */
#define ACMP_CR_ACMP0_INV_Msk           (0x1UL<<ACMP_CR_ACMP0_INV_Pos)                     /*!< ACMP CR: ACMP0_INV  Mask */

#define ACMP_CR_ACOMP0_PN_AutoEx_Pos    (19)                                               /*!< ACMP CR: ACOMP0_PN_AutoEx Position    */
#define ACMP_CR_ACOMP0_PN_AutoEx_Msk    (0x1ul << ACMP_CR_ACOMP0_PN_AutoEx_Pos)            /*!< ACMP CR: ACOMP0_PN_AutoEx Mask        */

#define ACMP_CR_ACMP0_FILTER_Pos        (20)                                               /*!< ACMP CR: ACMP0_FILTER Position        */
#define ACMP_CR_ACMP0_FILTER_Msk        (0x1ul << ACMP_CR_ACMP0_FILTER_Pos)                /*!< ACMP CR: ACMP0_FILTER Mask            */

#define ACMP_CR_CPO0_SEL_Pos            (21)                                               /*!< ACMP CR: CPO0_SEL Position            */
#define ACMP_CR_CPO0_SEL_Msk            (0x1ul << ACMP_CR_CPO0_SEL_Pos)                    /*!< ACMP CR: CPO0_SEL Mask                */

#define ACMP_CR_CPP0SEL_Pos             (29)                                               /*!< ACMP CR: CPP0SEL Position             */
#define ACMP_CR_CPP0SEL_Msk             (0x3ul << ACMP_CR_CPP0SEL_Pos)                     /*!< ACMP CR: CPP0SEL Mask                 */

#define ACMP_CR_ACMP_WKEUP_EN_Pos        (31)                                              /*!< ACMP CR: ACMP0_WKEUP_EN Position      */
#define ACMP_CR_ACMP_WKEUP_EN_Msk        (0x1ul << ACMP_CR_ACMP0_WKEUP_EN_Pos)             /*!< ACMP CR: ACMP0_WKEUP_EN Mask          */

#define ACMP_SR_ACMPF0_Pos               (0)                                               /*!< ACMP SR: ACMPF0 Position               */
#define ACMP_SR_ACMPF0_Msk               (0x1ul << ACMP_SR_ACMPF0_Pos)                     /*!< ACMP SR: ACMPF0 Mask                   */

#define ACMP_SR_ACMPF1_Pos               (1)                                               /*!< ACMP SR: ACMPF1 Position               */
#define ACMP_SR_ACMPF1_Msk               (0x1ul << ACMP_SR_ACMPF1_Pos)                     /*!< ACMP SR: ACMPF1 Mask                   */

#define ACMP_SR_CO0_Pos                  (2)                                               /*!< ACMP SR: CO0 Position                  */
#define ACMP_SR_CO0_Msk                  (0x1ul << ACMP_SR_CO0_Pos)                        /*!< ACMP SR: CO0 Mask                      */

#define ACMP_SR_CO1_Pos                  (3)                                               /*!< ACMP SR: CO1 Position                  */
#define ACMP_SR_CO1_Msk                  (0x1ul << ACMP_SR_CO1_Pos)                        /*!< ACMP SR: CO1 Mask                      */

#define ACMP_RVCR_CRVS_Pos               (0)                                               /*!< ACMP RVCR: CRVS Position               */
#define ACMP_RVCR_CRVS_Msk               (0xful << ACMP_RVCR_CRVS_Pos)                     /*!< ACMP RVCR: CRVS Mask                   */

#define ACMP_RVCR_CRV_EN_Pos             (4)                                               /*!< ACMP RVCR: CRV_EN Position             */
#define ACMP_RVCR_CRV_EN_Msk             (0x1ul << ACMP_RVCR_CRV_EN_Pos)                   /*!< ACMP RVCR: CRV_EN Mask                 */

#define ACMP_RVCR_CRVSRC_SEL_Pos         (5)                                               /*!< ACMP RVCR: CRVSRC_SEL Position         */
#define ACMP_RVCR_CRVSRC_SEL_Msk         (0x1ul << ACMP_RVCR_CRVSRC_SEL_Pos)               /*!< ACMP RVCR: CRVSRC_SEL Mask             */

#define ACMP_MODCR0_MOD_SEL_Pos          (0)                                               /*!< ACMP MODCR0: MOD_SEL Position          */
#define ACMP_MODCR0_MOD_SEL_Msk          (0x3ul << ACMP_MODCR0_MOD_SEL_Pos)                /*!< ACMP MODCR0: MOD_SEL Mask              */

#define ACMP_MODCR0_TMR_SEL_Pos          (2)                                               /*!< ACMP MODCR0: TMR_SEL Position          */
#define ACMP_MODCR0_TMR_SEL_Msk          (0x1ul << ACMP_MODCR0_TMR_SEL_Pos)                /*!< ACMP MODCR0: TMR_SEL Mask              */

#define ACMP_MODCR0_TMR_TRI_LV_Pos       (3)                                               /*!< ACMP MODCR0: TMR_TRI_LV Position       */
#define ACMP_MODCR0_TMR_TRI_LV_Msk       (0x1ul << ACMP_MODCR0_TMR_TRI_LV_Pos)             /*!< ACMP MODCR0: TMR_TRI_LV Mask           */

#define ACMP_MODCR0_CH_DIS_PIN_SEL_Pos   (4)                                               /*!< ACMP MODCR0: CH_DIS_PIN_SEL Position   */
#define ACMP_MODCR0_CH_DIS_PIN_SEL_Msk   (0x7ul << ACMP_MODCR0_CH_DIS_PIN_SEL_Pos)         /*!< ACMP MODCR0: CH_DIS_PIN_SEL Mask       */

#define ACMP_MODCR0_CH_DIS_FUN_SEL_Pos   (7)                                               /*!< ACMP MODCR0: CH_DIS_FUN_SEL Position   */
#define ACMP_MODCR0_CH_DIS_FUN_SEL_Msk   (0x1ul << ACMP_MODCR0_CH_DIS_FUN_SEL_Pos)         /*!< ACMP MODCR0: CH_DIS_FUN_SEL Mask       */

#define ACMP_MODCR0_START_Pos            (8)                                               /*!< ACMP MODCR0: START Position            */
#define ACMP_MODCR0_START_Msk            (0x1ul << ACMP_MODCR0_START_Pos)                  /*!< ACMP MODCR0: START Mask                */

/**@}*/ /* ACMP_CONST */
/**@}*/ /* end of ACMP register group */


/*---------------------- Analog to Digital Converter -------------------------*/
/**
    @addtogroup ADC Analog to Digital Converter(ADC)
    Memory Mapped Structure for ADC Controller
@{ */

