nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
    /**
     * SMPLCNT0
     * ===================================================================================================
     * Offset: 0x70  ADC Channel Sampling Time  Counter Register Group 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |CH0SAMPCNT|Channel 0 Sampling Counter
     * |        |          |0000 = 0 ADC clock
     * |        |          |0001 = 1 ADC clock
     * |        |          |0010 = 2 ADC clocks
     * |        |          |0011 = 4 ADC clocks
     * |        |          |0100 = 8 ADC clocks
     * |        |          |0101 = 16 ADC clocks
     * |        |          |0110 = 32 ADC clocks
     * |        |          |0111 = 64 ADC clocks
     * |        |          |1000 = 128 ADC clocks
     * |        |          |1001 = 256 ADC clocks
     * |        |          |1010 = 512 ADC clocks
     * |        |          |Others = 1024 ADC clocks
     * |[7:4]   |CH1SAMPCNT|Channel 1 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[11:8]  |CH2SAMPCNT|Channel 2 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[15:12] |CH3SAMPCNT|Channel 3 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[19:16] |CH4SAMPCNT|Channel 4 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[23:20] |CH5SAMPCNT|Channel 5 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[27:24] |CH6SAMPCNT|Channel 6 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
     * |[31:28] |CH7SAMPCNT|Channel 7 Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
    */
    __IO uint32_t SMPLCNT0;

    /**
     * SMPLCNT1
     * ===================================================================================================
     * Offset: 0x74  ADC Channel Sampling Time  Counter Register Group 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[19:16] |INTCHSAMPCNT|Internal Channel (VTEMP, AVDD, AVSS, Int_VREF) Sampling Counter
     * |        |          |The same as Channel 0 sampling counter table.
    */
    __IO uint32_t SMPLCNT1;

} ADC_T;

/**
    @addtogroup ADC_CONST ADC Bit Field Definition
    Constant Definitions for ADC Controller
@{ */

#define ADC_RESULT_RSLT_Pos              (0)                                               /*!< ADC RESULT: RSLT Position              */
#define ADC_RESULT_RSLT_Msk              (0xffful << ADC_RESULT_RSLT_Pos)                  /*!< ADC RESULT: RSLT Mask                  */

#define ADC_RESULT_VALID_Pos             (16)                                              /*!< ADC RESULT: VALID Position             */
#define ADC_RESULT_VALID_Msk             (0x1ul << ADC_RESULT_VALID_Pos)                   /*!< ADC RESULT: VALID Mask                 */

#define ADC_RESULT_OVERRUN_Pos           (17)                                              /*!< ADC RESULT: OVERRUN Position           */
#define ADC_RESULT_OVERRUN_Msk           (0x1ul << ADC_RESULT_OVERRUN_Pos)                 /*!< ADC RESULT: OVERRUN Mask               */

#define ADC_CR_ADEN_Pos                (0)                                               /*!< ADC CR: ADEN Position                */
#define ADC_CR_ADEN_Msk                (0x1ul << ADC_CR_ADEN_Pos)                      /*!< ADC CR: ADEN Mask                    */

#define ADC_CR_ADIE_Pos                (1)                                               /*!< ADC CR: ADIE Position                */
#define ADC_CR_ADIE_Msk                (0x1ul << ADC_CR_ADIE_Pos)                      /*!< ADC CR: ADIE Mask                    */

#define ADC_CR_ADMD_Pos                (2)                                               /*!< ADC CR: ADMD Position                */
#define ADC_CR_ADMD_Msk                (0x3ul << ADC_CR_ADMD_Pos)                      /*!< ADC CR: ADMD Mask                    */

#define ADC_CR_TRGS_Pos                (4)                                               /*!< ADC CR: TRGS Position                */
#define ADC_CR_TRGS_Msk                (0x3ul << ADC_CR_TRGS_Pos)                      /*!< ADC CR: TRGS Mask                    */

#define ADC_CR_TRGCOND_Pos             (6)                                               /*!< ADC CR: TRGCOND Position             */
#define ADC_CR_TRGCOND_Msk             (0x3ul << ADC_CR_TRGCOND_Pos)                   /*!< ADC CR: TRGCOND Mask                 */

#define ADC_CR_TRGE_Pos                (8)                                               /*!< ADC CR: TRGE Position                */
#define ADC_CR_TRGE_Msk                (0x1ul << ADC_CR_TRGE_Pos)                      /*!< ADC CR: TRGE Mask                    */

#define ADC_CR_PTEN_Pos                (9)                                               /*!< ADC CR: PTEN Position                */
#define ADC_CR_PTEN_Msk                (0x1ul << ADC_CR_PTEN_Pos)                      /*!< ADC CR: PTEN Mask                    */

#define ADC_CR_DIFF_Pos                (10)                                              /*!< ADC CR: DIFF Position                */
#define ADC_CR_DIFF_Msk                (0x1ul << ADC_CR_DIFF_Pos)                      /*!< ADC CR: DIFF Mask                    */

#define ADC_CR_ADST_Pos                (11)                                              /*!< ADC CR: ADST Position                */
#define ADC_CR_ADST_Msk                (0x1ul << ADC_CR_ADST_Pos)                      /*!< ADC CR: ADST Mask                    */

#define ADC_CR_TMSEL_Pos               (12)                                              /*!< ADC CR: TMSEL Position               */
#define ADC_CR_TMSEL_Msk               (0x3ul << ADC_CR_TMSEL_Pos)                     /*!< ADC CR: TMSEL Mask                   */

#define ADC_CR_TMTRGMOD_Pos            (15)                                              /*!< ADC CR: TMTRGMOD Position            */
#define ADC_CR_TMTRGMOD_Msk            (0x1ul << ADC_CR_TMTRGMOD_Pos)                  /*!< ADC CR: TMTRGMOD Mask                */

#define ADC_CR_REFSEL_Pos              (16)                                              /*!< ADC CR: REFSEL Position              */
#define ADC_CR_REFSEL_Msk              (0x3ul << ADC_CR_REFSEL_Pos)                    /*!< ADC CR: REFSEL Mask                  */

