nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
    /**
     * FRQDIV0
     * ===================================================================================================
     * Offset: 0x28  Frequency Divider0 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |FSEL      |Divider Output Frequency Selection Bits
     * |        |          |The formula of output frequency is
     * |        |          |FCLK0 = FRQDIV0_CLK/2^(N+1),.
     * |        |          |Where FRQDIV0_CLK is the input clock frequency, Fout is the frequency of divider output clock and N is the 4-bit value of FSEL[3:0].
     * |[4]     |FDIV_EN   |Frequency Divider Enable Bit
     * |        |          |0 = Frequency Divider Disabled.
     * |        |          |1 = Frequency Divider Enabled.
     * |[5]     |DIV1      |Output Frequency Divide By 1
     * |        |          |0 = Output frequency is equal to FCLK0.
     * |        |          |1 = Output frequency is equal to FRQDIV0_CLK.
    */
    __IO uint32_t FRQDIV0;
    uint32_t RESERVE0[1];


    /**
     * WK_INTSTS
     * ===================================================================================================
     * Offset: 0x30  Wake-up Interrupt Status
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PD_WK_IS  |Wake-Up Interrupt Status In Chip Power-Down Mode
     * |        |          |This bit indicates that some event resumes chip from Power-down mode
     * |        |          |The status is set if external interrupts, UART, GPIO, RTC, USB, SPI, Timer, WDT, and BOD wake-up occurred.
     * |        |          |Write 1 to clear this bit.
    */
    __IO uint32_t WK_INTSTS;

    /**
     * APB_DIV
     * ===================================================================================================
     * Offset: 0x34  APB Clock Divider
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |APBDIV    |APB Clock Divider
     * |        |          |APB PCLK can be divided from HCLK.
     * |        |          |000: PCLK = HCLK.
     * |        |          |001: PCLK =1/2 HCLK.
     * |        |          |010: PCLK = 1/4 HCLK.
     * |        |          |011: PCLK = 1/8 HCLK.
     * |        |          |100: PCLK = 1/16 HCLK.
     * |        |          |Others: PCLK = HCLK.
    */
    __IO uint32_t APB_DIV;

    /**
     * FRQDIV1
     * ===================================================================================================
     * Offset: 0x38  Frequency Divider1 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |FSEL      |Divider Output Frequency Selection Bits
     * |        |          |The formula of output frequency is
     * |        |          |FCLK1 = FRQDIV1_CLK /2^(N+1),.
     * |        |          |Where FRQDIV1_CLK is the input clock frequency, Fout is the frequency of divider output clock and N is the 4-bit value of FSEL[3:0].
     * |[4]     |FDIV_EN   |Frequency Divider Enable Bit
     * |        |          |0 = Frequency Divider Disabled.
     * |        |          |1 = Frequency Divider Enabled.
     * |[5]     |DIV1      |Output Frequency Divide By 1
     * |        |          |0 = Output frequency is equal to FCLK1.
     * |        |          |1 = Output frequency is equal to FRQDIV1_CLK.
    */
    __IO uint32_t FRQDIV1;

    /**
     * SP_DET
     * ===================================================================================================
     * Offset: 0x3C  Clock Stop Detect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HCLK_DET  |HCLK Stop Detect Enable Control
     * |        |          |0 = HCLK stop detect Disabled.
     * |        |          |1 = HCLK stop detect Enabled.
     * |        |          |Once HCLK stop detected, hardware will force HCLK from LIRC.
     * |[1]     |HCLK_STOP_IE|HCLK Stop Detect Interrupt Enable Control
     * |        |          |0 = HCLK stop detect interrupt Disabled.
     * |        |          |1 = HCLK stop detect interrupt Enabled.
     * |[2]     |HXT_DET   |HXT Stop Detect Enable Control
     * |        |          |0 = HXT stop detect Disabled.
     * |        |          |1 = HXT stop detect Enabled.
     * |[3]     |HXT_STOP_IE|HXT Stop Detect Interrupt Enable Control
     * |        |          |0 = HXT stop detect interrupt Disabled.
     * |        |          |1 = HXT stop detect interrupt Enabled.
     * |[4]     |HIRC_DET  |HIRC Stop Detect Enable Control
     * |        |          |0 = HIRC stop detect Disabled.
     * |        |          |1 = HIRC stop detect Enabled.
     * |[5]     |HIRC_STOP_IE|HIRC Stop Detect Interrupt Enable Control
     * |        |          |0 = HIRC stop detect interrupt Disabled.
     * |        |          |1 = HIRC stop detect interrupt Enabled.
    */
    __IO uint32_t SP_DET;

    /**
     * SP_STS
     * ===================================================================================================
     * Offset: 0x40  Clock Stop Detect Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HCLK_SP_IS|HCLK Clock Stop Flag
     * |        |          |0 = HCLK normal.
     * |        |          |1 = HCLK abnormal.
     * |[2]     |HXT_SP_IS |HXT Stop Flag
     * |        |          |0 = HXT normal.
     * |        |          |1 = HXT abnormal.
     * |[4]     |HIRC_SP_IS|HIRC Stop Flag
     * |        |          |0 = HIRC normal.
     * |        |          |1 = HIRC abnormal.
     * |[10:8]  |HCLK_SEL  |HCLK Target Clock Select
     * |        |          |000 = HXT
     * |        |          |001 = LXT
     * |        |          |010 = PLL Clock
     * |        |          |011 = LIRC
     * |        |          |111 = HIRC
     * |        |          |Others = Reserved
    */
    __I  uint32_t SP_STS;

} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
@{ */

