nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
#define CLK_CLKSEL1_LCD_S_Pos            (18)                                              /*!< CLK CLKSEL1: LCD_S Position            */
#define CLK_CLKSEL1_LCD_S_Msk            (0x1ul << CLK_CLKSEL1_LCD_S_Pos)                  /*!< CLK CLKSEL1: LCD_S Mask                */

#define CLK_CLKSEL1_ADC_S_Pos            (19)                                              /*!< CLK CLKSEL1: ADC_S Position            */
#define CLK_CLKSEL1_ADC_S_Msk            (0x7ul << CLK_CLKSEL1_ADC_S_Pos)                  /*!< CLK CLKSEL1: ADC_S Mask                */

#define CLK_CLKSEL2_FRQDIV1_S_Pos        (0)                                               /*!< CLK CLKSEL2: FRQDIV1_S Position        */
#define CLK_CLKSEL2_FRQDIV1_S_Msk        (0x3ul << CLK_CLKSEL2_FRQDIV1_S_Pos)              /*!< CLK CLKSEL2: FRQDIV1_S Mask            */

#define CLK_CLKSEL2_FRQDIV0_S_Pos        (2)                                               /*!< CLK CLKSEL2: FRQDIV0_S Position        */
#define CLK_CLKSEL2_FRQDIV0_S_Msk        (0x3ul << CLK_CLKSEL2_FRQDIV0_S_Pos)              /*!< CLK CLKSEL2: FRQDIV0_S Mask            */

#define CLK_CLKSEL2_TMR2_S_Pos           (8)                                               /*!< CLK CLKSEL2: TMR2_S Position           */
#define CLK_CLKSEL2_TMR2_S_Msk           (0x7ul << CLK_CLKSEL2_TMR2_S_Pos)                 /*!< CLK CLKSEL2: TMR2_S Mask               */

#define CLK_CLKSEL2_TMR3_S_Pos           (12)                                              /*!< CLK CLKSEL2: TMR3_S Position           */
#define CLK_CLKSEL2_TMR3_S_Msk           (0x7ul << CLK_CLKSEL2_TMR3_S_Pos)                 /*!< CLK CLKSEL2: TMR3_S Mask               */

#define CLK_CLKSEL2_SC_S_Pos             (18)                                              /*!< CLK CLKSEL2: SC_S Position             */
#define CLK_CLKSEL2_SC_S_Msk             (0x3ul << CLK_CLKSEL2_SC_S_Pos)                   /*!< CLK CLKSEL2: SC_S Mask                 */

#define CLK_CLKSEL2_SPI0_S_Pos           (20)                                              /*!< CLK CLKSEL2: SPI0_S Position           */
#define CLK_CLKSEL2_SPI0_S_Msk           (0x1ul << CLK_CLKSEL2_SPI0_S_Pos)                 /*!< CLK CLKSEL2: SPI0_S Mask               */

#define CLK_CLKSEL2_SPI1_S_Pos           (21)                                              /*!< CLK CLKSEL2: SPI1_S Position           */
#define CLK_CLKSEL2_SPI1_S_Msk           (0x1ul << CLK_CLKSEL2_SPI1_S_Pos)                 /*!< CLK CLKSEL2: SPI1_S Mask               */

#define CLK_CLKDIV0_HCLK_N_Pos           (0)                                               /*!< CLK CLKDIV0: HCLK_N Position           */
#define CLK_CLKDIV0_HCLK_N_Msk           (0xful << CLK_CLKDIV0_HCLK_N_Pos)                 /*!< CLK CLKDIV0: HCLK_N Mask               */

#define CLK_CLKDIV0_UART_N_Pos           (8)                                               /*!< CLK CLKDIV0: UART_N Position           */
#define CLK_CLKDIV0_UART_N_Msk           (0xful << CLK_CLKDIV0_UART_N_Pos)                 /*!< CLK CLKDIV0: UART_N Mask               */

#define CLK_CLKDIV0_ADC_N_Pos            (16)                                              /*!< CLK CLKDIV0: ADC_N Position            */
#define CLK_CLKDIV0_ADC_N_Msk            (0xfful << CLK_CLKDIV0_ADC_N_Pos)                 /*!< CLK CLKDIV0: ADC_N Mask                */

#define CLK_CLKDIV0_SC0_N_Pos            (28)                                              /*!< CLK CLKDIV0: SC0_N Position            */
#define CLK_CLKDIV0_SC0_N_Msk            (0xful << CLK_CLKDIV0_SC0_N_Pos)                  /*!< CLK CLKDIV0: SC0_N Mask                */

#define CLK_CLKDIV1_SC1_N_Pos            (0)                                               /*!< CLK CLKDIV1: SC1_N Position            */
#define CLK_CLKDIV1_SC1_N_Msk            (0xful << CLK_CLKDIV1_SC1_N_Pos)                  /*!< CLK CLKDIV1: SC1_N Mask                */

#define CLK_CLKDIV1_TMR0_N_Pos           (8)                                               /*!< CLK CLKDIV1: TMR0_N Position           */
#define CLK_CLKDIV1_TMR0_N_Msk           (0xful << CLK_CLKDIV1_TMR0_N_Pos)                 /*!< CLK CLKDIV1: TMR0_N Mask               */

#define CLK_CLKDIV1_TMR1_N_Pos           (12)                                              /*!< CLK CLKDIV1: TMR1_N Position           */
#define CLK_CLKDIV1_TMR1_N_Msk           (0xful << CLK_CLKDIV1_TMR1_N_Pos)                 /*!< CLK CLKDIV1: TMR1_N Mask               */

#define CLK_CLKDIV1_TMR2_N_Pos           (16)                                              /*!< CLK CLKDIV1: TMR2_N Position           */
#define CLK_CLKDIV1_TMR2_N_Msk           (0xful << CLK_CLKDIV1_TMR2_N_Pos)                 /*!< CLK CLKDIV1: TMR2_N Mask               */

#define CLK_CLKDIV1_TMR3_N_Pos           (20)                                              /*!< CLK CLKDIV1: TMR3_N Position           */
#define CLK_CLKDIV1_TMR3_N_Msk           (0xful << CLK_CLKDIV1_TMR3_N_Pos)                 /*!< CLK CLKDIV1: TMR3_N Mask               */

#define CLK_PLLCTL_PLL_MLP_Pos           (0)                                               /*!< CLK PLLCTL: PLL_MLP Position           */
#define CLK_PLLCTL_PLL_MLP_Msk           (0x3ful << CLK_PLLCTL_PLL_MLP_Pos)                /*!< CLK PLLCTL: PLL_MLP Mask               */

#define CLK_PLLCTL_PLL_SRC_N_Pos         (8)                                               /*!< CLK PLLCTL: PLL_SRC_N Position         */
#define CLK_PLLCTL_PLL_SRC_N_Msk         (0xful << CLK_PLLCTL_PLL_SRC_N_Pos)               /*!< CLK PLLCTL: PLL_SRC_N Mask             */

#define CLK_PLLCTL_PD_Pos                (16)                                              /*!< CLK PLLCTL: PD Position                */
#define CLK_PLLCTL_PD_Msk                (0x1ul << CLK_PLLCTL_PD_Pos)                      /*!< CLK PLLCTL: PD Mask                    */

#define CLK_PLLCTL_PLL_SRC_Pos           (17)                                              /*!< CLK PLLCTL: PLL_SRC Position           */
#define CLK_PLLCTL_PLL_SRC_Msk           (0x1ul << CLK_PLLCTL_PLL_SRC_Pos)                 /*!< CLK PLLCTL: PLL_SRC Mask               */

#define CLK_FRQDIV0_FSEL_Pos             (0)                                               /*!< CLK FRQDIV0: FSEL Position             */
#define CLK_FRQDIV0_FSEL_Msk             (0xful << CLK_FRQDIV0_FSEL_Pos)                   /*!< CLK FRQDIV0: FSEL Mask                 */

#define CLK_FRQDIV0_FDIV_EN_Pos          (4)                                               /*!< CLK FRQDIV0: FDIV_EN Position          */
#define CLK_FRQDIV0_FDIV_EN_Msk          (0x1ul << CLK_FRQDIV0_FDIV_EN_Pos)                /*!< CLK FRQDIV0: FDIV_EN Mask              */

#define CLK_FRQDIV0_DIV1_Pos             (5)                                               /*!< CLK FRQDIV0: DIV1 Position             */
#define CLK_FRQDIV0_DIV1_Msk             (0x1ul << CLK_FRQDIV0_DIV1_Pos)                   /*!< CLK FRQDIV0: DIV1 Mask                 */

