nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
#define GP_IER_FIER15_Pos                (15)                                              /*!< GP IER: FIER15 Position                */
#define GP_IER_FIER15_Msk                (0x1ul << GP_IER_FIER15_Pos)                      /*!< GP IER: FIER15 Mask                    */

#define GP_IER_RIER0_Pos                 (16)                                              /*!< GP IER: RIER0 Position                 */
#define GP_IER_RIER0_Msk                 (0x1ul << GP_IER_RIER0_Pos)                       /*!< GP IER: RIER0 Mask                     */

#define GP_IER_RIER1_Pos                 (17)                                              /*!< GP IER: RIER1 Position                 */
#define GP_IER_RIER1_Msk                 (0x1ul << GP_IER_RIER1_Pos)                       /*!< GP IER: RIER1 Mask                     */

#define GP_IER_RIER2_Pos                 (18)                                              /*!< GP IER: RIER2 Position                 */
#define GP_IER_RIER2_Msk                 (0x1ul << GP_IER_RIER2_Pos)                       /*!< GP IER: RIER2 Mask                     */

#define GP_IER_RIER3_Pos                 (19)                                              /*!< GP IER: RIER3 Position                 */
#define GP_IER_RIER3_Msk                 (0x1ul << GP_IER_RIER3_Pos)                       /*!< GP IER: RIER3 Mask                     */

#define GP_IER_RIER4_Pos                 (20)                                              /*!< GP IER: RIER4 Position                 */
#define GP_IER_RIER4_Msk                 (0x1ul << GP_IER_RIER4_Pos)                       /*!< GP IER: RIER4 Mask                     */

#define GP_IER_RIER5_Pos                 (21)                                              /*!< GP IER: RIER5 Position                 */
#define GP_IER_RIER5_Msk                 (0x1ul << GP_IER_RIER5_Pos)                       /*!< GP IER: RIER5 Mask                     */

#define GP_IER_RIER6_Pos                 (22)                                              /*!< GP IER: RIER6 Position                 */
#define GP_IER_RIER6_Msk                 (0x1ul << GP_IER_RIER6_Pos)                       /*!< GP IER: RIER6 Mask                     */

#define GP_IER_RIER7_Pos                 (23)                                              /*!< GP IER: RIER7 Position                 */
#define GP_IER_RIER7_Msk                 (0x1ul << GP_IER_RIER7_Pos)                       /*!< GP IER: RIER7 Mask                     */

#define GP_IER_RIER8_Pos                 (24)                                              /*!< GP IER: RIER8 Position                 */
#define GP_IER_RIER8_Msk                 (0x1ul << GP_IER_RIER8_Pos)                       /*!< GP IER: RIER8 Mask                     */

#define GP_IER_RIER9_Pos                 (25)                                              /*!< GP IER: RIER9 Position                 */
#define GP_IER_RIER9_Msk                 (0x1ul << GP_IER_RIER9_Pos)                       /*!< GP IER: RIER9 Mask                     */

#define GP_IER_RIER10_Pos                (26)                                              /*!< GP IER: RIER10 Position                */
#define GP_IER_RIER10_Msk                (0x1ul << GP_IER_RIER10_Pos)                      /*!< GP IER: RIER10 Mask                    */

#define GP_IER_RIER11_Pos                (27)                                              /*!< GP IER: RIER11 Position                */
#define GP_IER_RIER11_Msk                (0x1ul << GP_IER_RIER11_Pos)                      /*!< GP IER: RIER11 Mask                    */

#define GP_IER_RIER12_Pos                (28)                                              /*!< GP IER: RIER12 Position                */
#define GP_IER_RIER12_Msk                (0x1ul << GP_IER_RIER12_Pos)                      /*!< GP IER: RIER12 Mask                    */

#define GP_IER_RIER13_Pos                (29)                                              /*!< GP IER: RIER13 Position                */
#define GP_IER_RIER13_Msk                (0x1ul << GP_IER_RIER13_Pos)                      /*!< GP IER: RIER13 Mask                    */

#define GP_IER_RIER14_Pos                (30)                                              /*!< GP IER: RIER14 Position                */
#define GP_IER_RIER14_Msk                (0x1ul << GP_IER_RIER14_Pos)                      /*!< GP IER: RIER14 Mask                    */

#define GP_IER_RIER15_Pos                (31)                                              /*!< GP IER: RIER15 Position                */
#define GP_IER_RIER15_Msk                (0x1ul << GP_IER_RIER15_Pos)                      /*!< GP IER: RIER15 Mask                    */

#define GP_ISRC_ISRC_Pos                 (0)                                               /*!< GP ISRC: ISRC Position                 */
#define GP_ISRC_ISRC_Msk                 (0xfffful << GP_ISRC_ISRC_Pos)                    /*!< GP ISRC: ISRC Mask                     */

#define GP_PUEN_PUEN_Pos                 (0)                                               /*!< GP PUEN: PUEN Position                 */
#define GP_PUEN_PUEN_Msk                 (0xfffful << GP_PUEN_PUEN_Pos)                    /*!< GP PUEN: PUEN Mask                     */
/**@}*/ /* GPIO_CONST */

/**
    @addtogroup GP_DB_CONST GP_DB Bit Field Definition
    Constant Definitions for GP_DB Controller
@{ */
#define GP_DBNCECON_PUEN_Pos             (0)                                               /*!< GP DBNCECON: PUEN Position             */
#define GP_DBNCECON_PUEN_Msk             (0xful << GP_DBNCECON_PUEN_Pos)                   /*!< GP DBNCECON: PUEN Mask                 */

#define GP_DBNCECON_DBCLKSRC_Pos         (4)                                               /*!< GP DBNCECON: DBCLKSRC Position         */
#define GP_DBNCECON_DBCLKSRC_Msk         (0x1ul << GP_DBNCECON_DBCLKSRC_Pos)               /*!< GP DBNCECON: DBCLKSRC Mask             */

#define GP_DBNCECON_DBCLK_ON_Pos         (5)                                               /*!< GP DBNCECON: DBCLK_ON Position         */
#define GP_DBNCECON_DBCLK_ON_Msk         (0x1ul << GP_DBNCECON_DBCLK_ON_Pos)               /*!< GP DBNCECON: DBCLK_ON Mask             */

/**@}*/ /* GP_DB_CONST */
/**@}*/ /* end of GP register group */


/*---------------------- Inter-IC Bus Controller -------------------------*/
/**
    @addtogroup I2C Inter-IC Bus Controller(I2C)
    Memory Mapped Structure for I2C Controller
@{ */

