nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
} I2C_T;

/**
    @addtogroup I2C_CONST I2C Bit Field Definition
    Constant Definitions for I2C Controller
@{ */

#define I2C_CON_IPEN_Pos                 (0)                                               /*!< I2C CON: IPEN Position                 */
#define I2C_CON_IPEN_Msk                 (0x1ul << I2C_CON_IPEN_Pos)                       /*!< I2C CON: IPEN Mask                     */

#define I2C_CON_ACK_Pos                  (1)                                               /*!< I2C CON: ACK Position                  */
#define I2C_CON_ACK_Msk                  (0x1ul << I2C_CON_ACK_Pos)                        /*!< I2C CON: ACK Mask                      */

#define I2C_CON_STOP_Pos                 (2)                                               /*!< I2C CON: STOP Position                 */
#define I2C_CON_STOP_Msk                 (0x1ul << I2C_CON_STOP_Pos)                       /*!< I2C CON: STOP Mask                     */

#define I2C_CON_START_Pos                (3)                                               /*!< I2C CON: START Position                */
#define I2C_CON_START_Msk                (0x1ul << I2C_CON_START_Pos)                      /*!< I2C CON: START Mask                    */

#define I2C_CON_I2C_STS_Pos              (4)                                               /*!< I2C CON: I2C_STS Position              */
#define I2C_CON_I2C_STS_Msk              (0x1ul << I2C_CON_I2C_STS_Pos)                    /*!< I2C CON: I2C_STS Mask                  */

#define I2C_CON_INTEN_Pos                (7)                                               /*!< I2C CON: INTEN Position                */
#define I2C_CON_INTEN_Msk                (0x1ul << I2C_CON_INTEN_Pos)                      /*!< I2C CON: INTEN Mask                    */

#define I2C_INTSTS_INTSTS_Pos            (0)                                               /*!< I2C INTSTS: INTSTS Position         */
#define I2C_INTSTS_INTSTS_Msk            (0x1ul << I2C_INTSTS_INTSTS_Pos)                  /*!< I2C INTSTS: INTSTS Mask             */

#define I2C_INTSTS_TIF_Pos               (1)                                               /*!< I2C INTSTS: TIF Position            */
#define I2C_INTSTS_TIF_Msk               (0x1ul << I2C_INTSTS_TIF_Pos)                     /*!< I2C INTSTS: TIF Mask                */

#define I2C_INTSTS_WAKEUP_ACK_DONE_Pos   (7)                                               /*!< I2C INTSTS: WAKEUP_ACK_DONE Position*/
#define I2C_INTSTS_WAKEUP_ACK_DONE_Msk   (0x1ul << I2C_INTSTS_WAKEUP_ACK_DONE_Pos)         /*!< I2C INTSTS: WAKEUP_ACK_DONE Mask    */

#define I2C_STATUS_STATUS_Pos            (0)                                               /*!< I2C STATUS: STATUS Position         */
#define I2C_STATUS_STATUS_Msk            (0xfful << I2C_STATUS_STATUS_Pos)                 /*!< I2C STATUS: STATUS Mask             */

#define I2C_DIV_CLK_DIV_Pos              (0)                                               /*!< I2C DIV: CLK_DIV Position           */
#define I2C_DIV_CLK_DIV_Msk              (0xfful << I2C_DIV_CLK_DIV_Pos)                   /*!< I2C DIV: CLK_DIV Mask               */

#define I2C_TOUT_TOUTEN_Pos              (0)                                               /*!< I2C TOUT: TOUTEN Position           */
#define I2C_TOUT_TOUTEN_Msk              (0x1ul << I2C_TOUT_TOUTEN_Pos)                    /*!< I2C TOUT: TOUTEN Mask               */

#define I2C_TOUT_DIV4_Pos                (1)                                               /*!< I2C TOUT: DIV4 Position             */
#define I2C_TOUT_DIV4_Msk                (0x1ul << I2C_TOUT_DIV4_Pos)                      /*!< I2C TOUT: DIV4 Mask                 */

#define I2C_DATA_DATA_Pos                (0)                                               /*!< I2C DATA: DATA Position             */
#define I2C_DATA_DATA_Msk                (0xfful << I2C_DATA_DATA_Pos)                     /*!< I2C DATA: DATA Mask                 */

#define I2C_SADDR0_GCALL_Pos             (0)                                               /*!< I2C SADDR0: GCALL Position          */
#define I2C_SADDR0_GCALL_Msk             (0x1ul << I2C_SADDR0_GCALL_Pos)                   /*!< I2C SADDR0: GCALL Mask              */

#define I2C_SADDR0_SADDR_Pos             (1)                                               /*!< I2C SADDR0: SADDR Position          */
#define I2C_SADDR0_SADDR_Msk             (0x7ful << I2C_SADDR0_SADDR_Pos)                  /*!< I2C SADDR0: SADDR Mask              */

#define I2C_SADDR1_GCALL_Pos             (0)                                               /*!< I2C SADDR1: GCALL Position          */
#define I2C_SADDR1_GCALL_Msk             (0x1ul << I2C_SADDR1_GCALL_Pos)                   /*!< I2C SADDR1: GCALL Mask              */

#define I2C_SADDR1_SADDR_Pos             (1)                                               /*!< I2C SADDR1: SADDR Position          */
#define I2C_SADDR1_SADDR_Msk             (0x7ful << I2C_SADDR1_SADDR_Pos)                  /*!< I2C SADDR1: SADDR Mask              */

#define I2C_SAMASK0_SAMASK_Pos           (1)                                               /*!< I2C SAMASK0: SAMASK Position        */
#define I2C_SAMASK0_SAMASK_Msk           (0x7ful << I2C_SAMASK0_SAMASK_Pos)                /*!< I2C SAMASK0: SAMASK Mask            */

#define I2C_SAMASK1_SAMASK_Pos           (1)                                               /*!< I2C SAMASK1: SAMASK Position        */
#define I2C_SAMASK1_SAMASK_Msk           (0x7ful << I2C_SAMASK1_SAMASK_Pos)                /*!< I2C SAMASK1: SAMASK Mask            */

#define I2C_CON2_WKUPEN_Pos              (0)                                               /*!< I2C CON2: WKUPEN Position            */
#define I2C_CON2_WKUPEN_Msk              (0x1ul << I2C_CON2_WKUPEN_Pos)                    /*!< I2C CON2: WKUPEN Mask                */

#define I2C_CON2_OVER_INTEN_Pos          (1)                                               /*!< I2C CON2: OVER_INTEN Position        */
#define I2C_CON2_OVER_INTEN_Msk          (0x1ul << I2C_CON2_OVER_INTEN_Pos)                /*!< I2C CON2: OVER_INTEN Mask            */

