nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
#define PWM_INTSTS_Duty0Syncflag_Pos     (4)                                               /*!< PWM INTSTS: Duty0Syncflag Position     */
#define PWM_INTSTS_Duty0Syncflag_Msk     (0x1ul << PWM_INTSTS_Duty0Syncflag_Pos)           /*!< PWM INTSTS: Duty0Syncflag Mask         */

#define PWM_INTSTS_Duty1Syncflag_Pos     (5)                                               /*!< PWM INTSTS: Duty1Syncflag Position     */
#define PWM_INTSTS_Duty1Syncflag_Msk     (0x1ul << PWM_INTSTS_Duty1Syncflag_Pos)           /*!< PWM INTSTS: Duty1Syncflag Mask         */

#define PWM_INTSTS_Duty2Syncflag_Pos     (6)                                               /*!< PWM INTSTS: Duty2Syncflag Position     */
#define PWM_INTSTS_Duty2Syncflag_Msk     (0x1ul << PWM_INTSTS_Duty2Syncflag_Pos)           /*!< PWM INTSTS: Duty2Syncflag Mask         */

#define PWM_INTSTS_Duty3Syncflag_Pos     (7)                                               /*!< PWM INTSTS: Duty3Syncflag Position     */
#define PWM_INTSTS_Duty3Syncflag_Msk     (0x1ul << PWM_INTSTS_Duty3Syncflag_Pos)           /*!< PWM INTSTS: Duty3Syncflag Mask         */

#define PWM_INTSTS_PresSyncFlag_Pos      (8)                                               /*!< PWM INTSTS: PresSyncFlag Position      */
#define PWM_INTSTS_PresSyncFlag_Msk      (0x1ul << PWM_INTSTS_PresSyncFlag_Pos)            /*!< PWM INTSTS: PresSyncFlag Mask          */

#define PWM_OE_CH0_OE_Pos                (0)                                               /*!< PWM OE: CH0_OE Position                */
#define PWM_OE_CH0_OE_Msk                (0x1ul << PWM_OE_CH0_OE_Pos)                      /*!< PWM OE: CH0_OE Mask                    */

#define PWM_OE_CH1_OE_Pos                (1)                                               /*!< PWM OE: CH1_OE Position                */
#define PWM_OE_CH1_OE_Msk                (0x1ul << PWM_OE_CH1_OE_Pos)                      /*!< PWM OE: CH1_OE Mask                    */

#define PWM_OE_CH2_OE_Pos                (2)                                               /*!< PWM OE: CH2_OE Position                */
#define PWM_OE_CH2_OE_Msk                (0x1ul << PWM_OE_CH2_OE_Pos)                      /*!< PWM OE: CH2_OE Mask                    */

#define PWM_OE_CH3_OE_Pos                (3)                                               /*!< PWM OE: CH3_OE Position                */
#define PWM_OE_CH3_OE_Msk                (0x1ul << PWM_OE_CH3_OE_Pos)                      /*!< PWM OE: CH3_OE Mask                    */

#define PWM_DUTY0_CN_Pos                 (0)                                               /*!< PWM DUTY0: CN Position                 */
#define PWM_DUTY0_CN_Msk                 (0xfffful << PWM_DUTY0_CN_Pos)                    /*!< PWM DUTY0: CN Mask                     */

#define PWM_DUTY0_CM_Pos                 (16)                                              /*!< PWM DUTY0: CM Position                 */
#define PWM_DUTY0_CM_Msk                 (0xfffful << PWM_DUTY0_CM_Pos)                    /*!< PWM DUTY0: CM Mask                     */

#define PWM_DATA0_DATA_Pos               (0)                                               /*!< PWM DATA0: DATA Position               */
#define PWM_DATA0_DATA_Msk               (0xfffful << PWM_DATA0_DATA_Pos)                  /*!< PWM DATA0: DATA Mask                   */

#define PWM_DATA0_DATA_H_Pos             (16)                                              /*!< PWM DATA0: DATA_H Position             */
#define PWM_DATA0_DATA_H_Msk             (0x7ffful << PWM_DATA0_DATA_H_Pos)                /*!< PWM DATA0: DATA_H Mask                 */

#define PWM_DATA0_sync_Pos               (31)                                              /*!< PWM DATA0: sync Position               */
#define PWM_DATA0_sync_Msk               (0x1ul << PWM_DATA0_sync_Pos)                     /*!< PWM DATA0: sync Mask                   */

#define PWM_DUTY1_CN_Pos                 (0)                                               /*!< PWM DUTY1: CN Position                 */
#define PWM_DUTY1_CN_Msk                 (0xfffful << PWM_DUTY1_CN_Pos)                    /*!< PWM DUTY1: CN Mask                     */

#define PWM_DUTY1_CM_Pos                 (16)                                              /*!< PWM DUTY1: CM Position                 */
#define PWM_DUTY1_CM_Msk                 (0xfffful << PWM_DUTY1_CM_Pos)                    /*!< PWM DUTY1: CM Mask                     */

#define PWM_DATA1_DATA_Pos               (0)                                               /*!< PWM DATA1: DATA Position               */
#define PWM_DATA1_DATA_Msk               (0xfffful << PWM_DATA1_DATA_Pos)                  /*!< PWM DATA1: DATA Mask                   */

#define PWM_DATA1_DATA_H_Pos             (16)                                              /*!< PWM DATA1: DATA_H Position             */
#define PWM_DATA1_DATA_H_Msk             (0x7ffful << PWM_DATA1_DATA_H_Pos)                /*!< PWM DATA1: DATA_H Mask                 */

#define PWM_DATA1_sync_Pos               (31)                                              /*!< PWM DATA1: sync Position               */
#define PWM_DATA1_sync_Msk               (0x1ul << PWM_DATA1_sync_Pos)                     /*!< PWM DATA1: sync Mask                   */

#define PWM_DUTY2_CN_Pos                 (0)                                               /*!< PWM DUTY2: CN Position                 */
#define PWM_DUTY2_CN_Msk                 (0xfffful << PWM_DUTY2_CN_Pos)                    /*!< PWM DUTY2: CN Mask                     */

#define PWM_DUTY2_CM_Pos                 (16)                                              /*!< PWM DUTY2: CM Position                 */
#define PWM_DUTY2_CM_Msk                 (0xfffful << PWM_DUTY2_CM_Pos)                    /*!< PWM DUTY2: CM Mask                     */

#define PWM_DATA2_DATA_Pos               (0)                                               /*!< PWM DATA2: DATA Position               */
#define PWM_DATA2_DATA_Msk               (0xfffful << PWM_DATA2_DATA_Pos)                  /*!< PWM DATA2: DATA Mask                   */

#define PWM_DATA2_DATA_H_Pos             (16)                                              /*!< PWM DATA2: DATA_H Position             */
#define PWM_DATA2_DATA_H_Msk             (0x7ffful << PWM_DATA2_DATA_H_Pos)                /*!< PWM DATA2: DATA_H Mask                 */

#define PWM_DATA2_sync_Pos               (31)                                              /*!< PWM DATA2: sync Position               */
#define PWM_DATA2_sync_Msk               (0x1ul << PWM_DATA2_sync_Pos)                     /*!< PWM DATA2: sync Mask                   */

#define PWM_DUTY3_CN_Pos                 (0)                                               /*!< PWM DUTY3: CN Position                 */
#define PWM_DUTY3_CN_Msk                 (0xfffful << PWM_DUTY3_CN_Pos)                    /*!< PWM DUTY3: CN Mask                     */

#define PWM_DUTY3_CM_Pos                 (16)                                              /*!< PWM DUTY3: CM Position                 */
#define PWM_DUTY3_CM_Msk                 (0xfffful << PWM_DUTY3_CM_Pos)                    /*!< PWM DUTY3: CM Mask                     */

#define PWM_DATA3_DATA_Pos               (0)                                               /*!< PWM DATA3: DATA Position               */
#define PWM_DATA3_DATA_Msk               (0xfffful << PWM_DATA3_DATA_Pos)                  /*!< PWM DATA3: DATA Mask                   */

#define PWM_DATA3_DATA_H_Pos             (16)                                              /*!< PWM DATA3: DATA_H Position             */
#define PWM_DATA3_DATA_H_Msk             (0x7ffful << PWM_DATA3_DATA_H_Pos)                /*!< PWM DATA3: DATA_H Mask                 */

#define PWM_DATA3_sync_Pos               (31)                                              /*!< PWM DATA3: sync Position               */
#define PWM_DATA3_sync_Msk               (0x1ul << PWM_DATA3_sync_Pos)                     /*!< PWM DATA3: sync Mask                   */

#define PWM_CAPCTL_INV0_Pos              (0)                                               /*!< PWM CAPCTL: INV0 Position              */
#define PWM_CAPCTL_INV0_Msk              (0x1ul << PWM_CAPCTL_INV0_Pos)                    /*!< PWM CAPCTL: INV0 Mask                  */

#define PWM_CAPCTL_CAPCH0EN_Pos          (1)                                               /*!< PWM CAPCTL: CAPCH0EN Position          */
#define PWM_CAPCTL_CAPCH0EN_Msk          (0x1ul << PWM_CAPCTL_CAPCH0EN_Pos)                /*!< PWM CAPCTL: CAPCH0EN Mask              */

