nabto/unabto/3rdparty/nuvoton/Library/Device/Nuvoton/Nano1X2Series/Include/Nano1x2Series.h
#define PWM_CAPINTSTS_CFLI2_Pos          (18)                                              /*!< PWM CAPINTSTS: CFLI2 Position          */
#define PWM_CAPINTSTS_CFLI2_Msk          (0x1ul << PWM_CAPINTSTS_CFLI2_Pos)                /*!< PWM CAPINTSTS: CFLI2 Mask              */

#define PWM_CAPINTSTS_CAPOVR2_Pos        (19)                                              /*!< PWM CAPINTSTS: CAPOVR2 Position        */
#define PWM_CAPINTSTS_CAPOVR2_Msk        (0x1ul << PWM_CAPINTSTS_CAPOVR2_Pos)              /*!< PWM CAPINTSTS: CAPOVR2 Mask            */

#define PWM_CAPINTSTS_CAPOVF2_Pos        (20)                                              /*!< PWM CAPINTSTS: CAPOVF2 Position        */
#define PWM_CAPINTSTS_CAPOVF2_Msk        (0x1ul << PWM_CAPINTSTS_CAPOVF2_Pos)              /*!< PWM CAPINTSTS: CAPOVF2 Mask            */

#define PWM_CAPINTSTS_CAPIF3_Pos         (24)                                              /*!< PWM CAPINTSTS: CAPIF3 Position         */
#define PWM_CAPINTSTS_CAPIF3_Msk         (0x1ul << PWM_CAPINTSTS_CAPIF3_Pos)               /*!< PWM CAPINTSTS: CAPIF3 Mask             */

#define PWM_CAPINTSTS_CRLI3_Pos          (25)                                              /*!< PWM CAPINTSTS: CRLI3 Position          */
#define PWM_CAPINTSTS_CRLI3_Msk          (0x1ul << PWM_CAPINTSTS_CRLI3_Pos)                /*!< PWM CAPINTSTS: CRLI3 Mask              */

#define PWM_CAPINTSTS_CFLI3_Pos          (26)                                              /*!< PWM CAPINTSTS: CFLI3 Position          */
#define PWM_CAPINTSTS_CFLI3_Msk          (0x1ul << PWM_CAPINTSTS_CFLI3_Pos)                /*!< PWM CAPINTSTS: CFLI3 Mask              */

#define PWM_CAPINTSTS_CAPOVR3_Pos        (27)                                              /*!< PWM CAPINTSTS: CAPOVR3 Position        */
#define PWM_CAPINTSTS_CAPOVR3_Msk        (0x1ul << PWM_CAPINTSTS_CAPOVR3_Pos)              /*!< PWM CAPINTSTS: CAPOVR3 Mask            */

#define PWM_CAPINTSTS_CAPOVF3_Pos        (28)                                              /*!< PWM CAPINTSTS: CAPOVF3 Position        */
#define PWM_CAPINTSTS_CAPOVF3_Msk        (0x1ul << PWM_CAPINTSTS_CAPOVF3_Pos)              /*!< PWM CAPINTSTS: CAPOVF3 Mask            */

#define PWM_CRL0_CRL_Pos                 (0)                                               /*!< PWM CRL0: CRL Position                 */
#define PWM_CRL0_CRL_Msk                 (0xfffful << PWM_CRL0_CRL_Pos)                    /*!< PWM CRL0: CRL Mask                     */

#define PWM_CRL0_CRL_H_Pos               (16)                                              /*!< PWM CRL0: CRL_H Position               */
#define PWM_CRL0_CRL_H_Msk               (0xfffful << PWM_CRL0_CRL_H_Pos)                  /*!< PWM CRL0: CRL_H Mask                   */

#define PWM_CFL0_CFL_Pos                 (0)                                               /*!< PWM CFL0: CFL Position                 */
#define PWM_CFL0_CFL_Msk                 (0xfffful << PWM_CFL0_CFL_Pos)                    /*!< PWM CFL0: CFL Mask                     */

#define PWM_CFL0_CFL_H_Pos               (16)                                              /*!< PWM CFL0: CFL_H Position               */
#define PWM_CFL0_CFL_H_Msk               (0xfffful << PWM_CFL0_CFL_H_Pos)                  /*!< PWM CFL0: CFL_H Mask                   */

#define PWM_CRL1_CRL_Pos                 (0)                                               /*!< PWM CRL1: CRL Position                 */
#define PWM_CRL1_CRL_Msk                 (0xfffful << PWM_CRL1_CRL_Pos)                    /*!< PWM CRL1: CRL Mask                     */

#define PWM_CRL1_CRL_H_Pos               (16)                                              /*!< PWM CRL1: CRL_H Position               */
#define PWM_CRL1_CRL_H_Msk               (0xfffful << PWM_CRL1_CRL_H_Pos)                  /*!< PWM CRL1: CRL_H Mask                   */

#define PWM_CFL1_CFL_Pos                 (0)                                               /*!< PWM CFL1: CFL Position                 */
#define PWM_CFL1_CFL_Msk                 (0xfffful << PWM_CFL1_CFL_Pos)                    /*!< PWM CFL1: CFL Mask                     */

#define PWM_CFL1_CFL_H_Pos               (16)                                              /*!< PWM CFL1: CFL_H Position               */
#define PWM_CFL1_CFL_H_Msk               (0xfffful << PWM_CFL1_CFL_H_Pos)                  /*!< PWM CFL1: CFL_H Mask                   */

#define PWM_CRL2_CRL_Pos                 (0)                                               /*!< PWM CRL2: CRL Position                 */
#define PWM_CRL2_CRL_Msk                 (0xfffful << PWM_CRL2_CRL_Pos)                    /*!< PWM CRL2: CRL Mask                     */

#define PWM_CRL2_CRL_H_Pos               (16)                                              /*!< PWM CRL2: CRL_H Position               */
#define PWM_CRL2_CRL_H_Msk               (0xfffful << PWM_CRL2_CRL_H_Pos)                  /*!< PWM CRL2: CRL_H Mask                   */

#define PWM_CFL2_CFL_Pos                 (0)                                               /*!< PWM CFL2: CFL Position                 */
#define PWM_CFL2_CFL_Msk                 (0xfffful << PWM_CFL2_CFL_Pos)                    /*!< PWM CFL2: CFL Mask                     */

#define PWM_CFL2_CFL_H_Pos               (16)                                              /*!< PWM CFL2: CFL_H Position               */
#define PWM_CFL2_CFL_H_Msk               (0xfffful << PWM_CFL2_CFL_H_Pos)                  /*!< PWM CFL2: CFL_H Mask                   */

#define PWM_CRL3_CRL_Pos                 (0)                                               /*!< PWM CRL3: CRL Position                 */
#define PWM_CRL3_CRL_Msk                 (0xfffful << PWM_CRL3_CRL_Pos)                    /*!< PWM CRL3: CRL Mask                     */

#define PWM_CRL3_CRL_H_Pos               (16)                                              /*!< PWM CRL3: CRL_H Position               */
#define PWM_CRL3_CRL_H_Msk               (0xfffful << PWM_CRL3_CRL_H_Pos)                  /*!< PWM CRL3: CRL_H Mask                   */

#define PWM_CFL3_CFL_Pos                 (0)                                               /*!< PWM CFL3: CFL Position                 */
#define PWM_CFL3_CFL_Msk                 (0xfffful << PWM_CFL3_CFL_Pos)                    /*!< PWM CFL3: CFL Mask                     */

#define PWM_CFL3_CFL_H_Pos               (16)                                              /*!< PWM CFL3: CFL_H Position               */
#define PWM_CFL3_CFL_H_Msk               (0xfffful << PWM_CFL3_CFL_H_Pos)                  /*!< PWM CFL3: CFL_H Mask                   */

#define PWM_PDMACH0_PDMACH01_Pos         (0)                                               /*!< PWM PDMACH0: PDMACH01 Position         */
#define PWM_PDMACH0_PDMACH01_Msk         (0xfful << PWM_PDMACH0_PDMACH01_Pos)              /*!< PWM PDMACH0: PDMACH01 Mask             */

#define PWM_PDMACH0_PDMACH02_Pos         (8)                                               /*!< PWM PDMACH0: PDMACH02 Position         */
#define PWM_PDMACH0_PDMACH02_Msk         (0xfful << PWM_PDMACH0_PDMACH02_Pos)              /*!< PWM PDMACH0: PDMACH02 Mask             */

#define PWM_PDMACH0_PDMACH03_Pos         (16)                                              /*!< PWM PDMACH0: PDMACH03 Position         */
#define PWM_PDMACH0_PDMACH03_Msk         (0xfful << PWM_PDMACH0_PDMACH03_Pos)              /*!< PWM PDMACH0: PDMACH03 Mask             */

#define PWM_PDMACH0_PDMACH04_Pos         (24)                                              /*!< PWM PDMACH0: PDMACH04 Position         */
#define PWM_PDMACH0_PDMACH04_Msk         (0xfful << PWM_PDMACH0_PDMACH04_Pos)              /*!< PWM PDMACH0: PDMACH04 Mask             */

#define PWM_PDMACH2_PDMACH21_Pos         (0)                                               /*!< PWM PDMACH2: PDMACH21 Position         */
#define PWM_PDMACH2_PDMACH21_Msk         (0xfful << PWM_PDMACH2_PDMACH21_Pos)              /*!< PWM PDMACH2: PDMACH21 Mask             */

